miniACS_V1_37/Linux/Tr69-Scripts/v5/181_DeleteAddThenGet.txt

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:cwmp="urn:dslforum-org:cwmp-1-0">
<soap:Header>
<cwmp:ID soap:mustUnderstand="1">2</cwmp:ID>
</soap:Header>
<soap:Body>
<DeleteObject xmlns="urn:dslforum-org:cwmp-1-0">
<ObjectName xsi:type="xsd:string">
<string>Device.Services.VoiceService.1.NetworkProfile.2.Line.1.</string>
</ObjectName>
<ParameterKey xsi:type="xsd:string">
<string>GoodForTest</string>
</ParameterKey>
</DeleteObject>
</soap:Body>
</soap:Envelope>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:cwmp="urn:dslforum-org:cwmp-1-0">
<soap:Header>
<cwmp:ID soap:mustUnderstand="1">2</cwmp:ID>
</soap:Header>
<soap:Body>
<AddObject xmlns="urn:dslforum-org:cwmp-1-0">
<ObjectName xsi:type="xsd:string">
<string>Device.Services.VoiceService.1.NetworkProfile.2.Line.</string>
</ObjectName>
<ParameterKey xsi:type="xsd:string">
<string>GoodForTest</string>
</ParameterKey>
</AddObject>
</soap:Body>
</soap:Envelope>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:cwmp="urn:dslforum-org:cwmp-1-0">
<soap:Header>
<cwmp:ID soap:mustUnderstand="1">2</cwmp:ID>
</soap:Header>
<soap:Body>
<cwmp:GetParameterValues>
<ParameterNames soap:arrayType="xsd:string(256)[1]">
<string>Device.Services.VoiceService.1.NetworkProfile.2.Line.1.</string>
</ParameterNames>
</cwmp:GetParameterValues>
</soap:Body>
</soap:Envelope>

